Tekla Open API Reference for Tekla Structures 2025
PolyLine Class
 The PolyLine class represents a line that consists of one or more line segments. To create a polyline, you have to give a list of the points that will form the polyline. The first point in the list will be connected with the second point in the list, the second point in the list will be connected with the third point in the list, etc.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.PolyLine
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PolyLine
<SerializableAttribute>
Public Class PolyLine
The PolyLine type exposes the following members.
Constructors
Name | Description
PolyLine
 Instantiates a polyline with the given Points.
Top
Properties
Name | Description
Points
 The points the polyline consists of.
Top
Methods
Name | Description
Equals
 Returns true if the objects are equal.
 (Overrides Object.Equals(Object).)
GetHashCode
 Returns a hash code for a polyline. Notice, in extremely rare cases, you might not get the same hash code for two polylines even though they are considered equal! This should, however, happen only in extremely rare cases!
 (Overrides Object.GetHashCode().)
Length
 Returns the length of a polyline.
Top
Operators
Name | Description
Equality
 Checks the equality of two polylines.
Inequality
 Checks the inequality of two polylines.
Top
See Also
Reference
Tekla.Structures.Geometry3d Namespace